# FlipCurve Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalMember..::..FlipCurve Method
AnalyticalMember Class See Also
---
Flip the Analytical Member
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public void FlipCurve()
```

Visual Basic
---
```text
Public Sub FlipCurve
```

Visual C++
---
```text
public:
void FlipCurve()
```

# See Also
AnalyticalMember Class
Autodesk.Revit.DB.Structure Namespace